---
type: DuctSizes
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 7
tags: [revit-api, class]
---

# DuctSizes

`Autodesk.Revit.DB.Mechanical.DuctSizes` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Contains | 2013 | `public bool Contains ( double nominalDiameter )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetDuctSizeIterator | — | `public DuctSizeIterator GetDuctSizeIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < MEPSize > GetEnumerator ()` |
| Property | Count | 2013 | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |